# **21. 조건에 맞는 회원수 구하기(250211)(SELECT)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에 가입한 회원 정보를 담은 USER_INFO 테이블입니다.
# USER_INFO 테이블은 아래와 같은 구조로 되어있으며 USER_ID, GENDER, AGE, JOINED는 각각 회원 ID, 성별, 나이, 가입일을 나타냅니다.

# Column name	Type	Nullable
# USER_ID	INTEGER	FALSE
# GENDER	TINYINT(1)	TRUE
# AGE	INTEGER	TRUE
# JOINED	DATE	FALSE
# GENDER 컬럼은 비어있거나 0 또는 1의 값을 가지며 0인 경우 남자를, 1인 경우는 여자를 나타냅니다.

# 문제
# USER_INFO 테이블에서 2021년에 가입한 회원 중 나이가 20세 이상 29세 이하인 회원이 몇 명인지 출력하는 SQL문을 작성해주세요.

# 예시
# 예를 들어 USER_INFO 테이블이 다음과 같다면

# USER_ID	GENDER	AGE	JOINED
# 1	1	26	2021-10-05
# 2	0	NULL	2021-11-25
# 3	1	22	2021-11-30
# 4	0	31	2021-12-03
# 5	0	28	2021-12-16
# 6	1	24	2022-01-03
# 7	1	NULL	2022-01-09
# 2021년에 가입한 회원 중 나이가 20세 이상 29세 이하인 회원은 USER_ID 가 1, 3, 5 인 회원들 이므로, 다음과 같이 결과가 나와야 합니다.

# USERS
# 3

1) 내가 쓴 코드

In [ ]:
# SELECT COUNT(USER_ID) as USER
# FROM USER_INFO
# WHERE JOINED LIKE '2021%'
# AND AGE >= '20'
# AND AGE <= '29'

2) gpt 제안 코드

In [ ]:
# SELECT COUNT(*) AS USERS
# FROM USER_INFO
# WHERE YEAR(JOINED) = 2021
# AND AGE BETWEEN 20 AND 29;

# **22. 흉부외과 또는 일반외과 의사 목록 출력하기(250212)(SELECT)**

In [ ]:
# 문제 설명
# 다음은 종합병원에 속한 의사 정보를 담은DOCTOR 테이블입니다.
# DOCTOR 테이블은 다음과 같으며 DR_NAME, DR_ID, LCNS_NO, HIRE_YMD, MCDP_CD, TLNO는
# 각각 의사이름, 의사ID, 면허번호, 고용일자, 진료과코드, 전화번호를 나타냅니다.

# Column name	Type	Nullable
# DR_NAME	VARCHAR(20)	FALSE
# DR_ID	VARCHAR(10)	FALSE
# LCNS_NO	VARCHAR(30)	FALSE
# HIRE_YMD	DATE	FALSE
# MCDP_CD	VARCHAR(6)	TRUE
# TLNO	VARCHAR(50)	TRUE
# 문제
# DOCTOR 테이블에서 진료과가 흉부외과(CS)이거나 일반외과(GS)인 의사의 이름, 의사ID, 진료과, 고용일자를 조회하는 SQL문을 작성해주세요.
# 이때 결과는 고용일자를 기준으로 내림차순 정렬하고, 고용일자가 같다면 이름을 기준으로 오름차순 정렬해주세요.

# 예시
# DOCTOR 테이블이 다음과 같을 때

# DR_NAME	DR_ID	LCNS_NO	HIRE_YMD	MCDP_CD	TLNO
# 루피	DR20090029	LC00010001	2009-03-01	CS	01085482011
# 패티	DR20090001	LC00010901	2009-07-01	CS	01085220122
# 뽀로로	DR20170123	LC00091201	2017-03-01	GS	01034969210
# 티거	DR20100011	LC00011201	2010-03-01	NP	01034229818
# 품바	DR20090231	LC00011302	2015-11-01	OS	01049840278
# 티몬	DR20090112	LC00011162	2010-03-01	FM	01094622190
# 니모	DR20200012	LC00911162	2020-03-01	CS	01089483921
# 오로라	DR20100031	LC00010327	2010-11-01	OS	01098428957
# 자스민	DR20100032	LC00010192	2010-03-01	GS	01023981922
# 벨	DR20100039	LC00010562	2010-07-01	GS	01058390758
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# DR_NAME	DR_ID	MCDP_CD	HIRE_YMD
# 니모	DR20200012	CS	2020-03-01
# 뽀로로	DR20170123	GS	2017-03-01
# 벨	DR20100039	GS	2010-07-01
# 자스민	DR20100032	GS	2010-03-01
# 패티	DR20090001	CS	2009-07-01
# 루피	DR20090029	CS	2009-03-01

# 주의사항
# 날짜 포맷은 예시와 동일하게 나와야합니다.

1) 내 코드

In [ ]:
# SELECT DR_NAME, DR_ID, MCDP_CD, DATE_FORMAT(HIRE_YMD, '%Y-%m-%d')
# FROM DOCTOR
# WHERE MCDP_CD = 'GS'
# OR MCDP_CD = 'CS'
# ORDER BY HIRE_YMD DESC, DR_NAME ASC

# **23. 조건에 맞는 아이템들의 가격의 총합 구하기(250213)(SUN, MAX, MIN)**

In [ ]:
# 문제 설명
# 다음은 어느 한 게임에서 사용되는 아이템들의 아이템 정보를 담은 ITEM_INFO 테이블입니다.
# ITEM_INFO 테이블은 다음과 같으며, ITEM_ID, ITEM_NAME, RARITY, PRICE는 각각 아이템 ID, 아이템 명, 아이템의 희귀도, 아이템의 가격을 나타냅니다.

# Column name	Type	Nullable
# ITEM_ID	INTEGER	FALSE
# ITEM_NAME	VARCHAR(N)	FALSE
# RARITY	INTEGER	FALSE
# PRICE	INTEGER	FALSE
# 문제
# ITEM_INFO 테이블에서 희귀도가 'LEGEND'인 아이템들의 가격의 총합을 구하는 SQL문을 작성해 주세요.
# 이때 컬럼명은 'TOTAL_PRICE'로 지정해 주세요.

# 예시
# 예를 들어 ITEM_INFO 테이블이 다음과 같다면

# ITEM_ID	ITEM_NAME	RARITY	PRICE
# 0	ITEM_A	COMMON	10000
# 1	ITEM_B	LEGEND	9000
# 2	ITEM_C	LEGEND	11000
# 3	ITEM_D	UNIQUE	10000
# 4	ITEM_E	LEGEND	12000
# 조건에 해당되는 아이템의 아이템 ID는 1, 2, 4이며 각 아이템들의 가격은 9000, 11000, 12000 이므로 조건에 해당되는 아이템들의 가격의 합은 다음과 같습니다.

# TOTAL_PRICE
# 32000

1) 내 코드

In [ ]:
# SELECT SUM(PRICE) AS TOTAL_PRICE
# FROM ITEM_INFO
# WHERE RARITY = 'LEGEND'

# **24. 카테고리별 상품 개수 구하기(250217)(String, Date)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에서 판매중인 상품들의 정보를 담은 PRODUCT 테이블입니다.
# PRODUCT 테이블은 아래와 같은 구조로 되어있으며, PRODUCT_ID, PRODUCT_CODE, PRICE는 각각 상품 ID, 상품코드, 판매가를 나타냅니다.

# Column name	Type	Nullable
# PRODUCT_ID	INTEGER	FALSE
# PRODUCT_CODE	VARCHAR(8)	FALSE
# PRICE	INTEGER	FALSE
# 상품 별로 중복되지 않는 8자리 상품코드 값을 가지며, 앞 2자리는 카테고리 코드를 의미합니다.

# 문제
# PRODUCT 테이블에서 상품 카테고리 코드(PRODUCT_CODE 앞 2자리) 별 상품 개수를 출력하는 SQL문을 작성해주세요. 결과는 상품 카테고리 코드를 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 PRODUCT 테이블이 다음과 같다면

# PRODUCT_ID	PRODUCT_CODE	PRICE
# 1	A1000011	10000
# 2	A1000045	9000
# 3	C3000002	22000
# 4	C3000006	15000
# 5	C3000010	30000
# 6	K1000023	17000
# 상품 카테고리 코드 별 상품은 아래와 같으므로,

# A1: PRODUCT_ID가 1, 2 인 상품
# C3: PRODUCT_ID가 3, 4, 5 인 상품
# K1: PRODUCT_ID가 6 인 상품
# 다음과 같은 결과가 나와야 합니다.

# CATEGORY	PRODUCTS
# A1	2
# C3	3
# K1	1

1) 내가 쓴 코드

In [ ]:
# SELECT LEFT(PRODUCT_CODE, 2) as CATEGORY, COUNT(*) as PRODUCTS
# FROM PRODUCT
# GROUP BY LEFT(PRODUCT_CODE, 2)
# ORDER BY PRODUCT_CODE